Switch>1> enable
          ^
% Invalid input detected at '^' marker.
	
Switch>S1# configure terminal
           ^
% Invalid input detected at '^' marker.
	
Switch>S1(config)# vlan 10
                   ^
% Invalid input detected at '^' marker.
	
Switch>S1(config-vlan)# name DATA_VLAN10
                        ^
% Invalid input detected at '^' marker.
	
Switch>S1(config-vlan)# exit
                        ^
% Invalid input detected at '^' marker.
	
Switch>S1(config)# vlan 30
                   ^
% Invalid input detected at '^' marker.
	
Switch>S1(config-vlan)# name DATA_VLAN30
                        ^
% Invalid input detected at '^' marker.
	
Switch>S1(config-vlan)# exit
                        ^
% Invalid input detected at '^' marker.
	
Switch>enable
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#name DATA_VLAN10
Switch(config-vlan)#exit
Switch(config)#vlan 30
Switch(config-vlan)#name DATA_VLAN30
Switch(config-vlan)#exit
Switch(config)#interface f0/6
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#interface f0/11
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 30
Switch(config-if)#exit
Switch(config)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/7, Fa0/8, Fa0/9
                                                Fa0/10, Fa0/12, Fa0/13, Fa0/14
                                                Fa0/15, Fa0/16, Fa0/17, Fa0/18
                                                Fa0/19, Fa0/20, Fa0/21, Fa0/22
                                                Fa0/23, Fa0/24, Gig0/1, Gig0/2
10   DATA_VLAN10                      active    Fa0/6
30   DATA_VLAN30                      active    Fa0/11
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface g0/1
Switch(config-if)#switchport mode trunk
Switch(config-if)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#show interface trunk


Switch#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

Switch#interface g0/1
                 ^
% Invalid input detected at '^' marker.
	
Switch#switchport mode trunk
                  ^
% Invalid input detected at '^' marker.
	
Switch#end
Translating "end"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address

Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface g0/1
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
Switch(config)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#show interface trunk
Port        Mode         Encapsulation  Status        Native vlan
Gig0/1      on           802.1q         trunking      1

Port        Vlans allowed on trunk
Gig0/1      1-1005

Port        Vlans allowed and active in management domain
Gig0/1      1,10,30

Port        Vlans in spanning tree forwarding state and not pruned
Gig0/1      1,10,30

Switch#